package main.java;

import java.util.Arrays;

/**
 * РЎС‚СЂР°С‚РµРіРёСЏ РёРіСЂРѕРєР° РјРѕР¶РµС‚ СѓРїСЂР°РІР»СЏС‚СЊ РІРѕР»С€РµР±РЅРёРєРѕРј РїРѕСЃСЂРµРґСЃС‚РІРѕРј СѓСЃС‚Р°РЅРѕРІРєРё СЃРІРѕР№СЃС‚РІ РѕР±СЉРµРєС‚Р° РґР°РЅРЅРѕРіРѕ РєР»Р°СЃСЃР°.
 */
public class Move {
    private double speed;
    private double strafeSpeed;
    private double turn;
    private ActionType action;
    private double castAngle;
    private double minCastDistance;
    private double maxCastDistance = 10000.0D;
    private long statusTargetId = -1L;
    private SkillType skillToLearn;
    private Message[] messages;

    /**
     * @return Р’РѕР·РІСЂР°С‰Р°РµС‚ С‚РµРєСѓС‰СѓСЋ СѓСЃС‚Р°РЅРѕРІРєСѓ СЃРєРѕСЂРѕСЃС‚Рё РїРµСЂРµРјРµС‰РµРЅРёСЏ.
     */
    public double getSpeed() {
        return speed;
    }

    /**
     * Р—Р°РґР°С‘С‚ СѓСЃС‚Р°РЅРѕРІРєСѓ СЃРєРѕСЂРѕСЃС‚Рё РїРµСЂРµРјРµС‰РµРЅРёСЏ РЅР° РѕРґРёРЅ С‚РёРє.
     * <p>
     * РЈСЃС‚Р°РЅРѕРІРєР° СЃРєРѕСЂРѕСЃС‚Рё РїРµСЂРµРјРµС‰РµРЅРёСЏ РїРѕ СѓРјРѕР»С‡Р°РЅРёСЋ Р»РµР¶РёС‚ РІ РёРЅС‚РµСЂРІР°Р»Рµ РѕС‚ {@code -game.wizardBackwardSpeed} РґРѕ
     * {@code game.wizardForwardSpeed}, РѕРґРЅР°РєРѕ РіСЂР°РЅРёС†С‹ РёРЅС‚РµСЂРІР°Р»Р° РјРѕРіСѓС‚ Р±С‹С‚СЊ СЂР°СЃС€РёСЂРµРЅС‹ РІ Р·Р°РІРёСЃРёРјРѕСЃС‚Рё РѕС‚ РёР·СѓС‡РµРЅРЅС‹С…
     * РІРѕР»С€РµР±РЅРёРєРѕРј СѓРјРµРЅРёР№, РѕС‚ РґРµР№СЃС‚РІРёСЏ РЅРµРєРѕС‚РѕСЂС‹С… Р°СѓСЂ, Р° С‚Р°РєР¶Рµ РІ СЃР»СѓС‡Р°Рµ РґРµР№СЃС‚РІРёСЏ СЃС‚Р°С‚СѓСЃР° {@code HASTENED}.
     * <p>
     * Р—РЅР°С‡РµРЅРёСЏ, РІС‹С…РѕРґСЏС‰РёРµ Р·Р° РёРЅС‚РµСЂРІР°Р», Р±СѓРґСѓС‚ РїСЂРёРІРµРґРµРЅС‹ Рє Р±Р»РёР¶Р°Р№С€РµР№ РµРіРѕ РіСЂР°РЅРёС†Рµ.
     * РџРѕР»РѕР¶РёС‚РµР»СЊРЅС‹Рµ Р·РЅР°С‡РµРЅРёСЏ СЃРѕРѕС‚РІРµС‚СЃС‚РІСѓСЋС‚ РґРІРёР¶РµРЅРёСЋ РІРїРµСЂС‘Рґ.
     * <p>
     * Р•СЃР»Рё {@code hypot(speed / maxSpeed, strafeSpeed / maxStrafeSpeed)} Р±РѕР»СЊС€Рµ {@code 1.0}, С‚Рѕ РѕР±Рµ СѓСЃС‚Р°РЅРѕРІРєРё СЃРєРѕСЂРѕСЃС‚Рё
     * РїРµСЂРµРјРµС‰РµРЅРёСЏ ({@code speed} Рё {@code strafeSpeed}) Р±СѓРґСѓС‚ РїРѕРґРµР»РµРЅС‹ РёРіСЂРѕРІС‹Рј СЃРёРјСѓР»СЏС‚РѕСЂРѕРј РЅР° СЌС‚Рѕ Р·РЅР°С‡РµРЅРёРµ.
     */
    public void setSpeed(double speed) {
        this.speed = speed;
    }

    /**
     * @return Р’РѕР·РІСЂР°С‰Р°РµС‚ С‚РµРєСѓС‰СѓСЋ СѓСЃС‚Р°РЅРѕРІРєСѓ СЃРєРѕСЂРѕСЃС‚Рё РїРµСЂРµРјРµС‰РµРЅРёСЏ Р±РѕРєРѕРј.
     */
    public double getStrafeSpeed() {
        return strafeSpeed;
    }

    /**
     * Р—Р°РґР°С‘С‚ СѓСЃС‚Р°РЅРѕРІРєСѓ СЃРєРѕСЂРѕСЃС‚Рё РїРµСЂРµРјРµС‰РµРЅРёСЏ Р±РѕРєРѕРј РЅР° РѕРґРёРЅ С‚РёРє.
     * <p>
     * РЈСЃС‚Р°РЅРѕРІРєР° СЃРєРѕСЂРѕСЃС‚Рё РїРµСЂРµРјРµС‰РµРЅРёСЏ РїРѕ СѓРјРѕР»С‡Р°РЅРёСЋ Р»РµР¶РёС‚ РІ РёРЅС‚РµСЂРІР°Р»Рµ РѕС‚ {@code -game.wizardStrafeSpeed} РґРѕ
     * {@code game.wizardStrafeSpeed}, РѕРґРЅР°РєРѕ РіСЂР°РЅРёС†С‹ РёРЅС‚РµСЂРІР°Р»Р° РјРѕРіСѓС‚ Р±С‹С‚СЊ СЂР°СЃС€РёСЂРµРЅС‹ РІ Р·Р°РІРёСЃРёРјРѕСЃС‚Рё РѕС‚ РёР·СѓС‡РµРЅРЅС‹С…
     * РІРѕР»С€РµР±РЅРёРєРѕРј СѓРјРµРЅРёР№, РѕС‚ РґРµР№СЃС‚РІРёСЏ РЅРµРєРѕС‚РѕСЂС‹С… Р°СѓСЂ, Р° С‚Р°РєР¶Рµ РІ СЃР»СѓС‡Р°Рµ РґРµР№СЃС‚РІРёСЏ СЃС‚Р°С‚СѓСЃР° {@code HASTENED}.
     * <p>
     * Р—РЅР°С‡РµРЅРёСЏ, РІС‹С…РѕРґСЏС‰РёРµ Р·Р° РёРЅС‚РµСЂРІР°Р», Р±СѓРґСѓС‚ РїСЂРёРІРµРґРµРЅС‹ Рє Р±Р»РёР¶Р°Р№С€РµР№ РµРіРѕ РіСЂР°РЅРёС†Рµ.
     * РџРѕР»РѕР¶РёС‚РµР»СЊРЅС‹Рµ Р·РЅР°С‡РµРЅРёСЏ СЃРѕРѕС‚РІРµС‚СЃС‚РІСѓСЋС‚ РґРІРёР¶РµРЅРёСЋ РЅР°РїСЂР°РІРѕ.
     * <p>
     * Р•СЃР»Рё {@code hypot(speed / maxSpeed, strafeSpeed / maxStrafeSpeed)} Р±РѕР»СЊС€Рµ {@code 1.0}, С‚Рѕ РѕР±Рµ СѓСЃС‚Р°РЅРѕРІРєРё СЃРєРѕСЂРѕСЃС‚Рё
     * РїРµСЂРµРјРµС‰РµРЅРёСЏ ({@code speed} Рё {@code strafeSpeed}) Р±СѓРґСѓС‚ РїРѕРґРµР»РµРЅС‹ РёРіСЂРѕРІС‹Рј СЃРёРјСѓР»СЏС‚РѕСЂРѕРј РЅР° СЌС‚Рѕ Р·РЅР°С‡РµРЅРёРµ.
     */
    public void setStrafeSpeed(double strafeSpeed) {
        this.strafeSpeed = strafeSpeed;
    }

    /**
     * @return Р’РѕР·РІСЂР°С‰Р°РµС‚ С‚РµРєСѓС‰РёР№ СѓРіРѕР» РїРѕРІРѕСЂРѕС‚Р° РІРѕР»С€РµР±РЅРёРєР°.
     */
    public double getTurn() {
        return turn;
    }

    /**
     * РЈСЃС‚Р°РЅР°РІР»РёРІР°РµС‚ СѓРіРѕР» РїРѕРІРѕСЂРѕС‚Р° РІРѕР»С€РµР±РЅРёРєР°.
     * <p/>
     * РЈРіРѕР» РїРѕРІРѕСЂРѕС‚Р° Р·Р°РґР°С‘С‚СЃСЏ РІ СЂР°РґРёР°РЅР°С… РѕС‚РЅРѕСЃРёС‚РµР»СЊРЅРѕ С‚РµРєСѓС‰РµРіРѕ РЅР°РїСЂР°РІР»РµРЅРёСЏ РІРѕР»С€РµР±РЅРёРєР° Рё РѕР±С‹С‡РЅРѕ РѕРіСЂР°РЅРёС‡РµРЅ РёРЅС‚РµСЂРІР°Р»РѕРј РѕС‚
     * {@code -game.wizardMaxTurnAngle} РґРѕ {@code game.wizardMaxTurnAngle}. Р•СЃР»Рё РЅР° РІРѕР»С€РµР±РЅРёРєР° РґРµР№СЃС‚РІСѓРµС‚ РјР°РіРёС‡РµСЃРєРёР№
     * СЃС‚Р°С‚СѓСЃ {@code HASTENED}, С‚Рѕ РЅРёР¶РЅСЋСЋ Рё РїСЂР°РІСѓСЋ РіСЂР°РЅРёС†Сѓ РёРЅС‚РµСЂРІР°Р»Р° РЅРµРѕР±С…РѕРґРёРјРѕ СѓРјРЅРѕР¶РёС‚СЊ РЅР°
     * {@code 1.0 + game.hastenedRotationBonusFactor}.
     * <p>
     * Р—РЅР°С‡РµРЅРёСЏ, РІС‹С…РѕРґСЏС‰РёРµ Р·Р° РёРЅС‚РµСЂРІР°Р», Р±СѓРґСѓС‚ РїСЂРёРІРµРґРµРЅС‹ Рє Р±Р»РёР¶Р°Р№С€РµР№ РµРіРѕ РіСЂР°РЅРёС†Рµ.
     * РџРѕР»РѕР¶РёС‚РµР»СЊРЅС‹Рµ Р·РЅР°С‡РµРЅРёСЏ СЃРѕРѕС‚РІРµС‚СЃС‚РІСѓСЋС‚ РїРѕРІРѕСЂРѕС‚Сѓ РїРѕ С‡Р°СЃРѕРІРѕР№ СЃС‚СЂРµР»РєРµ.
     */
    public void setTurn(double turn) {
        this.turn = turn;
    }

    /**
     * @return Р’РѕР·РІСЂР°С‰Р°РµС‚ С‚РµРєСѓС‰РµРµ РґРµР№СЃС‚РІРёРµ РІРѕР»С€РµР±РЅРёРєР°.
     */
    public ActionType getAction() {
        return action;
    }

    /**
     * РЈСЃС‚Р°РЅР°РІР»РёРІР°РµС‚ РґРµР№СЃС‚РІРёРµ РІРѕР»С€РµР±РЅРёРєР°.
     * <p>
     * Р”РµР№СЃС‚РІРёРµ РјРѕР¶РµС‚ Р±С‹С‚СЊ РїСЂРѕРёРіРЅРѕСЂРёСЂРѕРІР°РЅРѕ РёРіСЂРѕРІС‹Рј СЃРёРјСѓР»СЏС‚РѕСЂРѕРј, РµСЃР»Рё Сѓ РІРѕР»С€РµР±РЅРёРєР° РЅРµРґРѕСЃС‚Р°С‚РѕС‡РЅРѕ РјР°РіРёС‡РµСЃРєРѕР№ СЌРЅРµСЂРіРёРё РґР»СЏ
     * РµРіРѕ СЃРѕРІРµСЂС€РµРЅРёСЏ Рё/РёР»Рё РІРѕР»С€РµР±РЅРёРє РµС‰С‘ РЅРµ СѓСЃРїРµР» РІРѕСЃСЃС‚Р°РЅРѕРІРёС‚СЊСЃСЏ РїРѕСЃР»Рµ РїСЂРµРґС‹РґСѓС‰РµРіРѕ РґРµР№СЃС‚РІРёСЏ.
     */
    public void setAction(ActionType action) {
        this.action = action;
    }

    /**
     * @return Р’РѕР·РІСЂР°С‰Р°РµС‚ С‚РµРєСѓС‰РёР№ СѓРіРѕР» РїРѕР»С‘С‚Р° РјР°РіРёС‡РµСЃРєРѕРіРѕ СЃРЅР°СЂСЏРґР°.
     */
    public double getCastAngle() {
        return castAngle;
    }

    /**
     * РЈСЃС‚Р°РЅР°РІР»РёРІР°РµС‚ СѓРіРѕР» РїРѕР»С‘С‚Р° РјР°РіРёС‡РµСЃРєРѕРіРѕ СЃРЅР°СЂСЏРґР°.
     * <p>
     * РЈРіРѕР» РїРѕР»С‘С‚Р° Р·Р°РґР°С‘С‚СЃСЏ РІ СЂР°РґРёР°РЅР°С… РѕС‚РЅРѕСЃРёС‚РµР»СЊРЅРѕ С‚РµРєСѓС‰РµРіРѕ РЅР°РїСЂР°РІР»РµРЅРёСЏ РІРѕР»С€РµР±РЅРёРєР° Рё РѕРіСЂР°РЅРёС‡РµРЅ РёРЅС‚РµСЂРІР°Р»РѕРј РѕС‚
     * {@code -game.staffSector / 2.0} РґРѕ {@code game.staffSector / 2.0}.
     * <p>
     * Р—РЅР°С‡РµРЅРёСЏ, РІС‹С…РѕРґСЏС‰РёРµ Р·Р° РёРЅС‚РµСЂРІР°Р», Р±СѓРґСѓС‚ РїСЂРёРІРµРґРµРЅС‹ Рє Р±Р»РёР¶Р°Р№С€РµР№ РµРіРѕ РіСЂР°РЅРёС†Рµ.
     * РџРѕР»РѕР¶РёС‚РµР»СЊРЅС‹Рµ Р·РЅР°С‡РµРЅРёСЏ СЃРѕРѕС‚РІРµС‚СЃС‚РІСѓСЋС‚ РїРѕРІРѕСЂРѕС‚Сѓ РїРѕ С‡Р°СЃРѕРІРѕР№ СЃС‚СЂРµР»РєРµ.
     * <p>
     * РџР°СЂР°РјРµС‚СЂ Р±СѓРґРµС‚ РїСЂРѕРёРіРЅРѕСЂРёСЂРѕРІР°РЅ РёРіСЂРѕРІС‹Рј СЃРёРјСѓР»СЏС‚РѕСЂРѕРј, РµСЃР»Рё РґРµР№СЃС‚РІРёРµ РІРѕР»С€РµР±РЅРёРєР° РЅРµ СЃРІСЏР·Р°РЅРѕ СЃ СЃРѕР·РґР°РЅРёРµРј РјР°РіРёС‡РµСЃРєРѕРіРѕ
     * СЃРЅР°СЂСЏРґР°.
     */
    public void setCastAngle(double castAngle) {
        this.castAngle = castAngle;
    }

    /**
     * @return Р’РѕР·РІСЂР°С‰Р°РµС‚ С‚РµРєСѓС‰СѓСЋ СѓСЃС‚Р°РЅРѕРІРєСѓ РґР»СЏ Р±Р»РёР¶РЅРµР№ РіСЂР°РЅРёС†С‹ Р±РѕРµРІРѕРіРѕ РїСЂРёРјРµРЅРµРЅРёСЏ РјР°РіРёС‡РµСЃРєРѕРіРѕ СЃРЅР°СЂСЏРґР°.
     */
    public double getMinCastDistance() {
        return minCastDistance;
    }

    /**
     * РЈСЃС‚Р°РЅР°РІР»РёРІР°РµС‚ Р±Р»РёР¶РЅСЋСЋ РіСЂР°РЅРёС†Сѓ Р±РѕРµРІРѕРіРѕ РїСЂРёРјРµРЅРµРЅРёСЏ РјР°РіРёС‡РµСЃРєРѕРіРѕ СЃРЅР°СЂСЏРґР°.
     * <p>
     * Р•СЃР»Рё СЂР°СЃСЃС‚РѕСЏРЅРёРµ РѕС‚ С†РµРЅС‚СЂР° СЃРЅР°СЂСЏРґР° РґРѕ С‚РѕС‡РєРё РµРіРѕ РїРѕСЏРІР»РµРЅРёСЏ РјРµРЅСЊС€Рµ, С‡РµРј Р·РЅР°С‡РµРЅРёРµ РґР°РЅРЅРѕРіРѕ РїР°СЂР°РјРµС‚СЂР°, С‚Рѕ Р±РѕРµРІС‹Рµ
     * СЃРІРѕР№СЃС‚РІР° СЃРЅР°СЂСЏРґР° РёРіРЅРѕСЂРёСЂСѓСЋС‚СЃСЏ. РЎРЅР°СЂСЏРґ Р±РµСЃРїСЂРµРїСЏС‚СЃС‚РІРµРЅРЅРѕ РїСЂРѕС…РѕРґРёС‚ СЃРєРІРѕР·СЊ РІСЃРµ РґСЂСѓРіРёРµ РёРіСЂРѕРІС‹Рµ РѕР±СЉРµРєС‚С‹, Р·Р° РёСЃРєР»СЋС‡РµРЅРёРµРј
     * РґРµСЂРµРІСЊРµРІ.
     * <p>
     * Р—РЅР°С‡РµРЅРёРµ РїР°СЂР°РјРµС‚СЂР° РїРѕ СѓРјРѕР»С‡Р°РЅРёСЋ СЂР°РІРЅРѕ {@code 0.0}. РЎС‚РѕР»РєРЅРѕРІРµРЅРёСЏ СЃРЅР°СЂСЏРґР° Рё СЋРЅРёС‚Р°, РєРѕС‚РѕСЂС‹Р№ РµРіРѕ СЃРѕР·РґР°Р»,
     * РёРіРЅРѕСЂРёСЂСѓСЋС‚СЃСЏ.
     * <p>
     * РџР°СЂР°РјРµС‚СЂ Р±СѓРґРµС‚ РїСЂРѕРёРіРЅРѕСЂРёСЂРѕРІР°РЅ РёРіСЂРѕРІС‹Рј СЃРёРјСѓР»СЏС‚РѕСЂРѕРј, РµСЃР»Рё РґРµР№СЃС‚РІРёРµ РІРѕР»С€РµР±РЅРёРєР° РЅРµ СЃРІСЏР·Р°РЅРѕ СЃ СЃРѕР·РґР°РЅРёРµРј РјР°РіРёС‡РµСЃРєРѕРіРѕ
     * СЃРЅР°СЂСЏРґР°.
     */
    public void setMinCastDistance(double minCastDistance) {
        this.minCastDistance = minCastDistance;
    }

    /**
     * @return Р’РѕР·РІСЂР°С‰Р°РµС‚ С‚РµРєСѓС‰СѓСЋ СѓСЃС‚Р°РЅРѕРІРєСѓ РґР»СЏ РґР°Р»СЊРЅРµР№ РіСЂР°РЅРёС†С‹ Р±РѕРµРІРѕРіРѕ РїСЂРёРјРµРЅРµРЅРёСЏ РјР°РіРёС‡РµСЃРєРѕРіРѕ СЃРЅР°СЂСЏРґР°.
     */
    public double getMaxCastDistance() {
        return maxCastDistance;
    }

    /**
     * РЈСЃС‚Р°РЅР°РІР»РёРІР°РµС‚ РґР°Р»СЊРЅСЋСЋ РіСЂР°РЅРёС†Сѓ Р±РѕРµРІРѕРіРѕ РїСЂРёРјРµРЅРµРЅРёСЏ РјР°РіРёС‡РµСЃРєРѕРіРѕ СЃРЅР°СЂСЏРґР°.
     * <p>
     * Р•СЃР»Рё СЂР°СЃСЃС‚РѕСЏРЅРёРµ РѕС‚ С†РµРЅС‚СЂР° СЃРЅР°СЂСЏРґР° РґРѕ С‚РѕС‡РєРё РµРіРѕ РїРѕСЏРІР»РµРЅРёСЏ Р±РѕР»СЊС€Рµ, С‡РµРј Р·РЅР°С‡РµРЅРёРµ РґР°РЅРЅРѕРіРѕ РїР°СЂР°РјРµС‚СЂР°, С‚Рѕ СЃРЅР°СЂСЏРґ
     * СѓР±РёСЂР°РµС‚СЃСЏ РёР· РёРіСЂРѕРІРѕРіРѕ РјРёСЂР°. РџСЂРё СЌС‚РѕРј, СЃРЅР°СЂСЏРґ С‚РёРїР° {@code FIREBALL} РґРµС‚РѕРЅРёСЂСѓРµС‚.
     * <p>
     * Р—РЅР°С‡РµРЅРёРµ РїР°СЂР°РјРµС‚СЂР° РїРѕ СѓРјРѕР»С‡Р°РЅРёСЋ Р·Р°РІРµРґРѕРјРѕ РІС‹С€Рµ РјР°РєСЃРёРјР°Р»СЊРЅРѕР№ РґР°Р»СЊРЅРѕСЃС‚Рё РїРѕР»С‘С‚Р° Р»СЋР±РѕРіРѕ С‚РёРїР° СЃРЅР°СЂСЏРґРѕРІ РІ РёРіСЂРµ.
     * <p>
     * РџР°СЂР°РјРµС‚СЂ Р±СѓРґРµС‚ РїСЂРѕРёРіРЅРѕСЂРёСЂРѕРІР°РЅ РёРіСЂРѕРІС‹Рј СЃРёРјСѓР»СЏС‚РѕСЂРѕРј, РµСЃР»Рё РґРµР№СЃС‚РІРёРµ РІРѕР»С€РµР±РЅРёРєР° РЅРµ СЃРІСЏР·Р°РЅРѕ СЃ СЃРѕР·РґР°РЅРёРµРј РјР°РіРёС‡РµСЃРєРѕРіРѕ
     * СЃРЅР°СЂСЏРґР°.
     */
    public void setMaxCastDistance(double maxCastDistance) {
        this.maxCastDistance = maxCastDistance;
    }

    /**
     * @return Р’РѕР·РІСЂР°С‰Р°РµС‚ РёРґРµРЅС‚РёС„РёРєР°С‚РѕСЂ С‚РµРєСѓС‰РµР№ С†РµР»Рё РґР»СЏ РїСЂРёРјРµРЅРµРЅРёСЏ РјР°РіРёС‡РµСЃРєРѕРіРѕ СЃС‚Р°С‚СѓСЃР°.
     */
    public long getStatusTargetId() {
        return statusTargetId;
    }

    /**
     * РЈСЃС‚Р°РЅР°РІР»РёРІР°РµС‚ РёРґРµРЅС‚РёС„РёРєР°С‚РѕСЂ С†РµР»Рё РґР»СЏ РїСЂРёРјРµРЅРµРЅРёСЏ РјР°РіРёС‡РµСЃРєРѕРіРѕ СЃС‚Р°С‚СѓСЃР°.
     * <p>
     * Р”РѕРїСѓСЃС‚РёРјС‹РјРё С†РµР»СЏРјРё СЏРІР»СЏСЋС‚СЃСЏ С‚РѕР»СЊРєРѕ РІРѕР»С€РµР±РЅРёРєРё РґСЂСѓР¶РµСЃС‚РІРµРЅРЅРѕР№ С„СЂР°РєС†РёРё. Р•СЃР»Рё РІРѕР»С€РµР±РЅРёРє СЃ СѓРєР°Р·Р°РЅРЅС‹Рј РёРґРµРЅС‚РёС„РёРєР°С‚РѕСЂРѕРј
     * РЅРµ РЅР°Р№РґРµРЅ, С‚Рѕ СЃС‚Р°С‚СѓСЃ РїСЂРёРјРµРЅСЏРµС‚СЃСЏ РЅРµРїРѕСЃСЂРµРґСЃС‚РІРµРЅРЅРѕ Рє РІРѕР»С€РµР±РЅРёРєСѓ, СЃРѕРІРµСЂС€Р°СЋС‰РµРјСѓ РґРµР№СЃС‚РІРёРµ. РћС‚РЅРѕСЃРёС‚РµР»СЊРЅС‹Р№ СѓРіРѕР» РґРѕ С†РµР»Рё
     * РґРѕР»Р¶РµРЅ Р»РµР¶Р°С‚СЊ РІ РёРЅС‚РµСЂРІР°Р»Рµ РѕС‚ {@code -game.staffSector / 2.0} РґРѕ {@code game.staffSector / 2.0}, Р° РјР°РєСЃРёРјР°Р»СЊРЅР°СЏ
     * РґРёСЃС‚Р°РЅС†РёСЏ РѕРіСЂР°РЅРёС‡РµРЅР° РґР°Р»СЊРЅРѕСЃС‚СЊСЋ РїРѕР»С‘С‚Р° РјР°РіРёС‡РµСЃРєРѕРіРѕ СЃРЅР°СЂСЏРґР° СЌС‚РѕРіРѕ РІРѕР»С€РµР±РЅРёРєР°. Р•С‘ Р±Р°Р·РѕРІРѕРµ Р·РЅР°С‡РµРЅРёРµ СЂР°РІРЅРѕ
     * {@code game.wizardCastRange}, РѕРґРЅР°РєРѕ РѕРЅРѕ РјРѕР¶РµС‚ Р±С‹С‚СЊ СѓРІРµР»РёС‡РµРЅРѕ РїРѕСЃР»Рµ РёР·СѓС‡РµРЅРёСЏ РЅРµРєРѕС‚РѕСЂС‹С… СѓРјРµРЅРёР№.
     * <p>
     * Р—РЅР°С‡РµРЅРёРµ РїР°СЂР°РјРµС‚СЂР° РїРѕ СѓРјРѕР»С‡Р°РЅРёСЋ СЂР°РІРЅРѕ {@code -1}.
     * <p>
     * РџР°СЂР°РјРµС‚СЂ Р±СѓРґРµС‚ РїСЂРѕРёРіРЅРѕСЂРёСЂРѕРІР°РЅ РёРіСЂРѕРІС‹Рј СЃРёРјСѓР»СЏС‚РѕСЂРѕРј, РµСЃР»Рё РґРµР№СЃС‚РІРёРµ РІРѕР»С€РµР±РЅРёРєР° РЅРµ СЃРІСЏР·Р°РЅРѕ СЃ РїСЂРёРјРµРЅРµРЅРёРµРј РјР°РіРёС‡РµСЃРєРѕРіРѕ
     * СЃС‚Р°С‚СѓСЃР°.
     */
    public void setStatusTargetId(long statusTargetId) {
        this.statusTargetId = statusTargetId;
    }

    /**
     * @return Р’РѕР·РІСЂР°С‰Р°РµС‚ РІС‹Р±СЂР°РЅРЅРѕРµ РґР»СЏ РёР·СѓС‡РµРЅРёСЏ СѓРјРµРЅРёРµ.
     */
    public SkillType getSkillToLearn() {
        return skillToLearn;
    }

    /**
     * Р—Р°РґР°С‘С‚ СѓСЃС‚Р°РЅРѕРІРєСѓ РёР·СѓС‡РёС‚СЊ СѓРєР°Р·Р°РЅРЅРѕРµ СѓРјРµРЅРёРµ РґРѕ РЅР°С‡Р°Р»Р° СЃР»РµРґСѓСЋС‰РµРіРѕ РёРіСЂРѕРІРѕРіРѕ С‚РёРєР°.
     * <p>
     * РЈСЃС‚Р°РЅРѕРІРєР° Р±СѓРґРµС‚ РїСЂРѕРёРіРЅРѕСЂРёСЂРѕРІР°РЅР° РёРіСЂРѕРІС‹Рј СЃРёРјСѓР»СЏС‚РѕСЂРѕРј, РµСЃР»Рё С‚РµРєСѓС‰РёР№ СѓСЂРѕРІРµРЅСЊ РІРѕР»С€РµР±РЅРёРєР° РјРµРЅСЊС€Рµ Р»РёР±Рѕ СЂР°РІРµРЅ РєРѕР»РёС‡РµСЃС‚РІСѓ
     * СѓР¶Рµ РёР·СѓС‡РµРЅРЅС‹С… СѓРјРµРЅРёР№. РќРµРєРѕС‚РѕСЂС‹Рµ СѓРјРµРЅРёСЏ С‚Р°РєР¶Рµ РјРѕРіСѓС‚ С‚СЂРµР±РѕРІР°С‚СЊ РїСЂРµРґРІР°СЂРёС‚РµР»СЊРЅРѕРіРѕ РёР·СѓС‡РµРЅРёСЏ РґСЂСѓРіРёС… СѓРјРµРЅРёР№.
     * <p>
     * Р�Р·СѓС‡РµРЅРёРµ СѓРјРµРЅРёР№ РґРѕСЃС‚СѓРїРЅРѕ РЅРµ РІРѕ РІСЃРµС… СЂРµР¶РёРјР°С… РёРіСЂС‹.
     */
    public void setSkillToLearn(SkillType skillToLearn) {
        this.skillToLearn = skillToLearn;
    }

    /**
     * @return Р’РѕР·РІСЂР°С‰Р°РµС‚ С‚РµРєСѓС‰РёРµ СЃРѕРѕР±С‰РµРЅРёСЏ РґР»СЏ РІРѕР»С€РµР±РЅРёРєРѕРІ РґСЂСѓР¶РµСЃС‚РІРµРЅРЅРѕР№ С„СЂР°РєС†РёРё.
     */
    public Message[] getMessages() {
        return messages == null ? null : Arrays.copyOf(messages, messages.length);
    }

    /**
     * РЈСЃС‚Р°РЅР°РІР»РёРІР°РµС‚ СЃРѕРѕР±С‰РµРЅРёСЏ РґР»СЏ РІРѕР»С€РµР±РЅРёРєРѕРІ РґСЂСѓР¶РµСЃС‚РІРµРЅРЅРѕР№ С„СЂР°РєС†РёРё.
     * <p>
     * Р”РѕСЃС‚СѓРїРЅРѕ РґР»СЏ РёСЃРїРѕР»СЊР·РѕРІР°РЅРёСЏ С‚РѕР»СЊРєРѕ РІРµСЂС…РѕРІРЅРѕРјСѓ РІРѕР»С€РµР±РЅРёРєСѓ ({@code wizard.master}). Р•СЃР»Рё РёСЃРїРѕР»СЊР·СѓРµС‚СЃСЏ, РєРѕР»РёС‡РµСЃС‚РІРѕ
     * СЃРѕРѕР±С‰РµРЅРёР№ РґРѕР»Р¶РЅРѕ Р±С‹С‚СЊ СЃС‚СЂРѕРіРѕ СЂР°РІРЅРѕ РєРѕР»РёС‡РµСЃС‚РІСѓ РІРѕР»С€РµР±РЅРёРєРѕРІ РґСЂСѓР¶РµСЃС‚РІРµРЅРЅРѕР№ С„СЂР°РєС†РёРё (Р¶РёРІС‹С… РёР»Рё РѕР¶РёРґР°СЋС‰РёС… РІРѕР·СЂРѕР¶РґРµРЅРёСЏ)
     * Р·Р° РёСЃРєР»СЋС‡РµРЅРёРµРј СЃР°РјРѕРіРѕ РІРµСЂС…РѕРІРЅРѕРіРѕ РІРѕР»С€РµР±РЅРёРєР°. РќР°СЂСѓС€РµРЅРёРµ РґР°РЅРЅС‹С… СѓСЃР»РѕРІРёР№ РјРѕР¶РµС‚ РїСЂРёРІРµСЃС‚Рё Рє РёРіРЅРѕСЂРёСЂРѕРІР°РЅРёСЋ РїР°СЂР°РјРµС‚СЂР°
     * РёРіСЂРѕРІС‹Рј СЃРёРјСѓР»СЏС‚РѕСЂРѕРј РёР»Рё РґР°Р¶Рµ Рє РѕР±СЂС‹РІСѓ СЃРѕРµРґРёРЅРµРЅРёСЏ СЃРѕ СЃС‚СЂР°С‚РµРіРёРµР№ СѓС‡Р°СЃС‚РЅРёРєР°.
     * <p>
     * РЎРѕРѕР±С‰РµРЅРёСЏ Р°РґСЂРµСЃСѓСЋС‚СЃСЏ РІ РїРѕСЂСЏРґРєРµ РІРѕР·СЂР°СЃС‚Р°РЅРёСЏ РёРґРµРЅС‚РёС„РёРєР°С‚РѕСЂРѕРІ РІРѕР»С€РµР±РЅРёРєРѕРІ. РћС‚РґРµР»СЊРЅС‹Рµ СЃРѕРѕР±С‰РµРЅРёСЏ РјРѕРіСѓС‚ Р±С‹С‚СЊ РїСѓСЃС‚С‹РјРё
     * (СЂР°РІРЅС‹ {@code null}), РµСЃР»Рё СЌС‚Рѕ РїРѕРґРґРµСЂР¶РёРІР°РµС‚СЃСЏ СЏР·С‹РєРѕРј РїСЂРѕРіСЂР°РјРјРёСЂРѕРІР°РЅРёСЏ, РєРѕС‚РѕСЂС‹Р№ РёСЃРїРѕР»СЊР·СѓРµС‚ СЃС‚СЂР°С‚РµРіРёСЏ. Р’ РїСЂРѕС‚РёРІРЅРѕРј
     * СЃР»СѓС‡Р°Рµ РІСЃРµ СЌР»РµРјРµРЅС‚С‹ РґРѕР»Р¶РЅС‹ Р±С‹С‚СЊ РєРѕСЂСЂРµРєС‚РЅС‹РјРё СЃРѕРѕР±С‰РµРЅРёСЏРјРё.
     * <p>
     * Р�РіСЂРѕРІРѕР№ СЃРёРјСѓР»СЏС‚РѕСЂ РІРїСЂР°РІРµ РїСЂРѕРёРіРЅРѕСЂРёСЂРѕРІР°С‚СЊ СЃРѕРѕР±С‰РµРЅРёРµ РєРѕРЅРєСЂРµС‚РЅРѕРјСѓ РІРѕР»С€РµР±РЅРёРєСѓ, РµСЃР»Рё РґР»СЏ РЅРµРіРѕ РІ СЃРёСЃС‚РµРјРµ СѓР¶Рµ
     * Р·Р°СЂРµРіРёСЃС‚СЂРёСЂРѕРІР°РЅРѕ Рё РµС‰С‘ РёРј РЅРµ РїРѕР»СѓС‡РµРЅРѕ РґСЂСѓРіРѕРµ СЃРѕРѕР±С‰РµРЅРёРµ. Р•СЃР»Рё РІ С‚РёРє РїРѕР»СѓС‡РµРЅРёСЏ СЃРѕРѕР±С‰РµРЅРёСЏ РІРѕР»С€РµР±РЅРёРє РјС‘СЂС‚РІ, С‚Рѕ
     * РґР°РЅРЅРѕРµ СЃРѕРѕР±С‰РµРЅРёРµ Р±СѓРґРµС‚ СѓРґР°Р»РµРЅРѕ РёР· РёРіСЂРѕРІРѕРіРѕ РјРёСЂР° Рё РІРѕР»С€РµР±РЅРёРє РЅРёРєРѕРіРґР° РµРіРѕ РЅРµ РїРѕР»СѓС‡РёС‚.
     * <p>
     * РћС‚РїСЂР°РІРєР° СЃРѕРѕР±С‰РµРЅРёР№ РґРѕСЃС‚СѓРїРЅР° РЅРµ РІРѕ РІСЃРµС… СЂРµР¶РёРјР°С… РёРіСЂС‹.
     */
    public void setMessages(Message[] messages) {
        this.messages = messages == null ? null : Arrays.copyOf(messages, messages.length);
    }
}
